## MySQL Theory

1.  What is a database? Differentiate between SQL and NoSQL databases.

**Ans : Database is organized collection of data ,so that it can be easily accessed and managed.The main purpose of databases ois to operate a large amount of information by storing ,retrieving and managing the data.Moedern databases are managed by DBMS i.e. Data Base Management Systems.**  
**Databases can be of two types SQL and NoSQL.**  
**SQL  based databases are the relational databases and NoSQL are called non relational or distrubted databases.SQL databases uses Structured Query Language to create structured tabular data and their schema is predefined and static.On the other hand NoSQL does not have a predefined schema as it can store and work with unstructured data.**  
**Examples of SQL databases: MySQL,Postgresql,Ms SQL Server**  
**Examples of NoSQL databases: MongoDB,Cassandra,HBase**

2.  What is DDL? Explain why CREATE, DROP, ALTER, and TRUNCATE are used with an example.

**And: DDL stands for Data Definition Language in SQL.DDL contains those commands of SQL which are used to define the database schemas.It deals with the deals with the description of the database schemas and is used to define and modify the sturcture of database objects.DDL commands are used to define,create,modify and delete the structure of the database object and not he data.**  
**Examples of DDL commands:**  
**CREATE : It is used to create database or its objects like tables,views,stored procedures,functions,triggers,etc.**  
**DROP: It is used to delete database or database objects.**  
**ALTER: It is used to alter/modify the structure of database and its objects.**  
**TRUNCATE: It is used to remove all the records/data in a table.**

In [1]:
import mysql.connector

In [2]:
#creating connection object
mydb = mysql.connector.connect(host = "localhost" ,user = "dhyan" ,password = "pswd")
print(mydb)

<mysql.connector.connection_cext.CMySQLConnection object at 0x000002B5CC32A910>

In [3]:
#creating cursor object
mycur = mydb.cursor()

In [4]:
#CREATE a database and table(CREATE EXAMPLE)
mycur.execute('CREATE DATABASE IF NOT EXISTS testdb')
mycur.execute('CREATE DATABASE IF NOT EXISTS testdb1')
mycur.execute('CREATE TABLE IF NOT EXISTS testdb.table1(id int,name VARCHAR(20))')
mycur.execute('CREATE TABLE IF NOT EXISTS testdb.table2(cid int,c_name VARCHAR(20))')

In [5]:
mydb.close()

In [6]:
#printing all databases that we created
#creating connection object
mydb = mysql.connector.connect(host = "localhost" ,user = "dhyan" ,password = "pswd")
print(mydb)
mycur = mydb.cursor()
mycur.execute('SHOW DATABASES')

for i in mycur.fetchall():
    print(i)

<mysql.connector.connection_cext.CMySQLConnection object at 0x000002B5CC32A580>
('information_schema',)
('mysql',)
('performance_schema',)
('sakila',)
('sys',)
('testdb',)
('testdb1',)
('world',)

In [7]:
#DROP database named testdb1

mycur.execute('DROP DATABASE testdb1')
mycur.execute('SHOW DATABASES')

for i in mycur.fetchall():
    print(i)

('information_schema',)
('mysql',)
('performance_schema',)
('sakila',)
('sys',)
('testdb',)
('world',)

As you can see testdb1 is deleted

In [8]:
#ALTER the table testdb.table1 to add column age 

mycur.execute('ALTER TABLE testdb.table1 ADD age int')

In [9]:
#To TRUNCATE a table we will first add some values to it and then turncate it.

mycur.execute('INSERT into testdb.table1 values(1,"Dhyan",25)')
mycur.execute('INSERT into testdb.table1 values(2,"Vedant",30)')
mydb.commit()

In [10]:
mycur.execute('SELECT * FROM testdb.table1')
for i in mycur.fetchall():
    print(i)

(1, 'Dhyan', 25)
(2, 'Vedant', 30)

In [11]:
#NOW WE TRUNCATE IT

mycur.execute("TRUNCATE TABLE testdb.table1")

In [12]:
mycur.execute('SELECT * FROM testdb.table1')
for i in mycur.fetchall():
    print(i)

As you can see we get no records as all have been deleted

In [13]:
mydb.close()

3.  What is DML? Explain INSERT, UPDATE, and DELETE with an example.

**Ans: DML stands for Data Manipulation Language.The SQL commands that deals with the manipulation of data present in the database belong to DML or Data Manipulation Language and this includes most of the SQL statements. It is the component of the SQL statement that controls access to data and to the database.**   
**Examples of DML:**  
**INSERT : It is used to insert data into the tables.**  
**UPDATE : It is used to update the existing data in the tables.**  
**DELETE : It is used to Delete data records from a table.**

In [14]:
mydb = mysql.connector.connect(host = "localhost" ,user = "dhyan" ,password = "pswd")
print(mydb)
mycur = mydb.cursor()

<mysql.connector.connection_cext.CMySQLConnection object at 0x000002B5CC32AB50>

In [15]:
#INSERT :inserting values
mycur.execute('INSERT into testdb.table1 values(1,"Dhyan",25)')
mycur.execute('INSERT into testdb.table1 values(2,"Vedant",30)')
mycur.execute('INSERT into testdb.table1 values(3,"RandomMan",69)')
mydb.commit()

In [16]:
mycur.execute('SELECT * FROM testdb.table1')
for i in mycur.fetchall():
    print(i)

(1, 'Dhyan', 25)
(2, 'Vedant', 30)
(3, 'RandomMan', 69)

In [17]:
#UPDATE : update data
mycur.execute('UPDATE testdb.table1 SET age = 24 WHERE id = 1')
mydb.commit()

In [18]:
mycur.execute('SELECT * FROM testdb.table1')
for i in mycur.fetchall():
    print(i)

(1, 'Dhyan', 24)
(2, 'Vedant', 30)
(3, 'RandomMan', 69)

As you can see the age of id 1 has been updated.

In [19]:
#DELETE : delete data from table
mycur.execute('DELETE FROM testdb.table1 WHERE id = 3')
mydb.commit()

In [20]:
mycur.execute('SELECT * FROM testdb.table1')
for i in mycur.fetchall():
    print(i)

(1, 'Dhyan', 24)
(2, 'Vedant', 30)

As you can see the record with id = 3 has been deleted.

In [21]:
mydb.close()

4. What is DQL? Explain SELECT with an example.

**Ans: DQL stands for Data Query Language. that allows getting data from the database and imposing order upon it. It includes the SELECT statement.**  
**SELECT : This command allows getting the data out of the database to perform operations with it. When a SELECT is fired against a table or tables the result is compiled into a further temporary table, which is displayed or perhaps received by the 
program .**

In [22]:
#Example of SELECT statement

mydb = mysql.connector.connect(host = "localhost" ,user = "dhyan" ,password = "pswd")
print(mydb)
mycur = mydb.cursor()

mycur.execute('SELECT * FROM testdb.table1')
for i in mycur.fetchall():
    print(i)

<mysql.connector.connection_cext.CMySQLConnection object at 0x000002B5CC32AD00>
(1, 'Dhyan', 24)
(2, 'Vedant', 30)

When we use * it return all columns in the table ,we can also get specific columns by calling them in SELECT statement.

In [23]:
mycur.execute('SELECT name,age FROM testdb.table1')
for i in mycur.fetchall():
    print(i)

('Dhyan', 24)
('Vedant', 30)

In [24]:
mydb.close()

5.  Explain Primary Key and Foreign Key

**Ans:**  
**Primary key: A primary key is used to ensure that data in the specific column is unique. A primary key column cannot have NULL values. It is either an existing table column or a column that is specifically generated by the database according to a defined sequence.It uniquely classifies each record/row in the table.A table can have only ONE primary key; and in the table, this primary key can consist of single or multiple columns (fields).**     

**example: A customer_id column in customer table which takes unique values and can't be null can be used a primary key for that table.**

**Foreign key : A foreign key is a column or group of columns in a relational database table that provides a link between data in two tables. It is a column (or columns) that references a column (most often the primary key) of another table. A table can have more than one foreign key.**  

**example : The customer_id of customer table which acts as primary key in its own table ,can be the foreign key in the purchase table which has all the purchase transactions made by customers.**

6. Write a python code to connect MySQL to python. Explain the cursor() and execute() method.

**Ans:**  
**cursor(): The cursor() method of mysql.connector.connect() class instantiates and returns a cursor using C Extension.It is like a pointer .It acts as middleware between MySQL database connection and SQL query. It is created after giving connection to MySQL database.**  

**execute(): The execute() method of mysql.connector.connect().cursor() class executes given statement using given parameters.**

In [25]:
#code to connect MySQL to python
import mysql.connector

mydb = mysql.connector.connect(host = "localhost" ,user = "dhyan" ,password = "pswd")
print(mydb)
mycur = mydb.cursor()

<mysql.connector.connection_cext.CMySQLConnection object at 0x000002B5CC32A4C0>

In [26]:
mycur.execute('SELECT * FROM testdb.table1')
for i in mycur.fetchall():
    print(i)

(1, 'Dhyan', 24)
(2, 'Vedant', 30)

In [27]:
mydb.close()

7. Give the order of execution of SQL clauses in an SQL query.

**Ans: The order of execution of SQL Clauses in an SQL Query is:**  
1. **FROM/JOIN: The FROM and/or JOIN clauses are executed first to determine the data of interest.**

2. **WHERE: The WHERE clause is executed to filter out records that do not meet the constraints.**

3. **GROUP BY: The GROUP BY clause is executed to group the data based on the values in one or more columns.**

4. **HAVING: The HAVING clause is executed to remove the created grouped records that donâ€™t meet the constraints.**

5. **SELECT: The SELECT clause is executed to derive all desired columns and expressions.**

6. **ORDER BY: The ORDER BY clause is executed to sort the derived values in ascending or descending order.**

7. **LIMIT/OFFSET: Finally, the LIMIT and/or OFFSET clauses are executed to keep or skip a specified number of rows.**